In [44]:
from config import app_key
import requests
import pandas as pd
from sqlalchemy import create_engine
from datetime import datetime

In [32]:
lat = 34.0522
lon = -118.2437
start = 1641091892
end = 1643683892

In [33]:
url=f"http://api.openweathermap.org/data/2.5/air_pollution/history?lat={lat}&lon={lon}&start={start}&end={end}&appid={app_key}"

In [34]:
url

'http://api.openweathermap.org/data/2.5/air_pollution/history?lat=34.0522&lon=-118.2437&start=1641091892&end=1643683892&appid=0a31b257bf28874d6d38f176387a1a18'

In [35]:
response = requests.get(url)

In [36]:
print(response.status_code)

200

In [37]:
print(response.json()["list"][0])

{'main': {'aqi': 5}, 'components': {'co': 1949.31, 'no': 193.12, 'no2': 134.35, 'o3': 0, 'so2': 8.34, 'pm2_5': 93.36, 'pm10': 114.49, 'nh3': 14.82}, 'dt': 1641092400}

In [50]:
list_date = []
list_co = []
list_no2=[]
list_o3=[]
list_city = []



for row in response.json()["list"]:
    list_date.append(row['dt']),
    list_co.append(row['components']['co'])
    list_no2.append(row['components']['no2'])
    list_o3.append(row['components']['o3'])
    list_city.append("Los Angeles")
    
df_air_pollution = pd.DataFrame({
"Date": list_date,
"CO":list_co,
"Nitogen Dioxide":list_no2,
"Ozone":list_o3,
"City":list_city
})

In [51]:
df_air_pollution

           Date       CO  Nitogen Dioxide  Ozone         City
0    1641092400  1949.31           134.35   0.00  Los Angeles
1    1641096000  2189.64           128.87   0.00  Los Angeles
2    1641099600  2029.42           102.82   0.00  Los Angeles
3    1641103200  1668.93            82.25   0.00  Los Angeles
4    1641106800  1321.79            70.60   0.00  Los Angeles
..          ...      ...              ...    ...          ...
691  1643666400   694.27           100.08  67.23  Los Angeles
692  1643670000   600.81            87.05  75.82  Los Angeles
693  1643673600   560.76            85.68  68.66  Los Angeles
694  1643677200   634.19           108.30  34.69  Los Angeles
695  1643680800   801.09           134.35   1.72  Los Angeles

[696 rows x 5 columns]

In [52]:
df_air_pollution["Date_Time"] = pd.to_datetime(df_air_pollution['Date'], unit='s')

In [53]:
df_air_pollution

,Date,CO,Nitogen Dioxide,Ozone,City,Date_Time
0,1641092400,1949.31,134.35,0.00,Los Angeles,2022-01-02 03:00:00
1,1641096000,2189.64,128.87,0.00,Los Angeles,2022-01-02 04:00:00
2,1641099600,2029.42,102.82,0.00,Los Angeles,2022-01-02 05:00:00
3,1641103200,1668.93,82.25,0.00,Los Angeles,2022-01-02 06:00:00
4,1641106800,1321.79,70.60,0.00,Los Angeles,2022-01-02 07:00:00
...,...,...,...,...,...,...
691,1643666400,694.27,100.08,67.23,Los Angeles,2022-01-31 22:00:00
692,1643670000,600.81,87.05,75.82,Los Angeles,2022-01-31 23:00:00
693,1643673600,560.76,85.68,68.66,Los Angeles,2022-02-01 00:00:00
694,1643677200,634.19,108.30,34.69,Los Angeles,2022-02-01 01:00:00
695,1643680800,801.09,134.35,1.72,Los Angeles,2022-02-01 02:00:00

In [54]:
# df_weather.to_csv("file.csv")
engine = create_engine('postgresql://postgres:postgres@localhost:5432/air_pollution')

In [55]:
df_air_pollution.to_sql('air_pollution_forecast', engine, if_exists='replace',index=False) #drops old table and creates new empty table